# running in progctr_bmc/src/
read -formal progctr.sv
hierarchy -check -top progctr -chparam PC_NUM_BITS 5
prep -top progctr

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
